[
    {
        "name": "Plain Bagel",
        "description": "A classic bagel with a chewy texture.",
        "image": "https://placehold.co/96x96",
        "qualities": "Classic, Chewy, Traditional, Simple, Versatile, Satisfying, Doughy, Wholesome, Fresh, Tasty"
    },
    {
        "name": "Everything Bagel",
        "description": "A flavorful bagel topped with a mix of seeds and spices.",
        "image": "https://placehold.co/96x96",
        "qualities": "Flavorful, Seedy, Spicy, Multiseed, Aromatic, Exotic, Zesty, Robust, Crunchy, Irresistible"
    },
    {
        "name": "Sesame Bagel",
        "description": "A bagel topped with sesame seeds for added flavor.",
        "image": "https://placehold.co/96x96",
        "qualities": "Seedy, Nutritious, Toasted, Fragrant, Subtle, Delicate, Nutty, Golden, Balanced, Crisp"
    },
    {
        "name": "Poppy Seed Bagel",
        "description": "A bagel topped with poppy seeds for a unique taste.",
        "image": "https://placehold.co/96x96",
        "qualities": "Seedy, Unique, Artisanal, Rich, Earthy, Bold, Distinctive, Authentic, Handcrafted, Memorable"
    },
    {
        "name": "Cinnamon Raisin Bagel",
        "description": "A sweet bagel with cinnamon swirls and raisins throughout.",
        "image": "https://placehold.co/96x96",
        "qualities": "Sweet, Swirled, Raisin, Warm, Comforting, Indulgent, Cozy, Homely, Sugary, Nostalgic"
    },
    {
        "name": "Blueberry Bagel",
        "description": "A fruity bagel with blueberries mixed into the dough.",
        "image": "https://placehold.co/96x96",
        "qualities": "Fruity, Doughy, Blueberry, Juicy, Bursting, Refreshing, Summery, Bright, Juicy, Vibrant"
    },
    {
        "name": "Onion Bagel",
        "description": "A savory bagel with onion flakes baked into the dough.",
        "image": "https://placehold.co/96x96",
        "qualities": "Savory, Oniony, Fragrant, Robust, Savory, Aromatic, Rustic, Pungent, Hearty, Homey"
    },
    {
        "name": "Garlic Bagel",
        "description": "A flavorful bagel infused with garlic for a bold taste.",
        "image": "https://placehold.co/96x96",
        "qualities": "Flavorful, Bold, Garlicky, Intense, Aromatic, Piquant, Spicy, Rich, Tangy, Savory"
    },
    {
        "name": "Salt Bagel",
        "description": "A bagel topped with coarse salt for a savory crunch.",
        "image": "https://placehold.co/96x96",
        "qualities": "Savory, Crunchy, Salty, Crispy, Addictive, Seasoned, Tangy, Sharp, Bold, Distinctive"
    },
    {
        "name": "Pumpernickel Bagel",
        "description": "A dark and hearty bagel made with pumpernickel flour.",
        "image": "https://placehold.co/96x96",
        "qualities": "Dark, Hearty, Pumpernickel, Earthy, Robust, Dense, Rustic, Hearty, Wholesome, Satisfying"
    },
    {
        "name": "Whole Wheat Bagel",
        "description": "A nutritious bagel made with whole wheat flour.",
        "image": "https://placehold.co/96x96",
        "qualities": "Nutritious, Whole Wheat, Healthy, Fiber-rich, Nutty, Wholesome, Satisfying, Hearty, Earthy, Rustic"
    },
    {
        "name": "Rye Bagel",
        "description": "A traditional bagel made with rye flour for a distinct flavor.",
        "image": "https://placehold.co/96x96",
        "qualities": "Distinct, Traditional, Rye, Rustic, Hearty, Robust, Earthy, Authentic, Nutty, Savory"
    },
    {
        "name": "Cheddar Bagel",
        "description": "A savory bagel packed with sharp cheddar cheese.",
        "image": "https://placehold.co/96x96",
        "qualities": "Savory, Cheesy, Sharp, Rich, Creamy, Flavorful, Bold, Tangy, Melty, Irresistible"
    },
    {
        "name": "Asiago Bagel",
        "description": "A cheese lover's delight, with Asiago cheese baked into the dough.",
        "image": "https://placehold.co/96x96",
        "qualities": "Cheesy, Asiago, Bold, Nutty, Rich, Creamy, Savory, Irresistible, Unique, Indulgent"
    },
    {
        "name": "Jalapeno Bagel",
        "description": "A spicy bagel with bits of jalapeno pepper for a kick.",
        "image": "https://placehold.co/96x96",
        "qualities": "Spicy, Jalapeno, Fiery, Zesty, Bold, Tangy, Hot, Vibrant, Piquant, Exciting"
    }
]
